{
  "title": "The Obscene Arithmetic of State Plunder: $20,474 Per Person in Annual Theft",
  "body": "![Federal Spending Crisis](https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/US_Federal_Spending_Chart.png/800px-US_Federal_Spending_Chart.png)\n\n---\n\nThe federal government has reached a new milestone of moral bankruptcy: $7.035 trillion in spending for fiscal year 2025, or $20,474 per person. Let that figure sink in. Every man, woman, and child in America is being conscripted to finance the machinery of state power to the tune of over twenty thousand dollars annually. This is not merely a fiscal problem—it is a fundamental violation of property rights and human liberty.\n\nThe apologists for the state will offer their usual palliatives: \"The deficit narrowed!\" \"Revenues increased!\" These are the desperate consolations of those who have surrendered their moral compass. Whether the state steals $1.8 trillion or $1.7 trillion is irrelevant to the fundamental injustice. The question is not whether government spending is slightly less obscene than last year—the question is whether the state has any legitimate right to confiscate this wealth at all.\n\nLet us be clear about what this spending represents. It is not a voluntary exchange. It is not a contract freely entered into by consenting parties. It is coercion—the systematic extraction of wealth from productive citizens under threat of violence. The IRS does not ask politely. The state does not negotiate. It demands, and it punishes those who refuse to comply.\n\nWhere does this $7 trillion go? Into the military-industrial complex that maintains America's global empire. Into welfare bureaucracies that create dependency while enriching administrators. Into regulatory agencies that strangle entrepreneurship and innovation. Into the Federal Reserve's monetary manipulations that debase the currency and impoverish savers. Into foreign aid that enriches dictators and corrupt elites while American citizens struggle with inflation and stagnant wages.\n\nThe defenders of this system claim we need government to provide security, infrastructure, and social safety nets. But this is a false choice. The state has monopolized these functions through coercion, then claims credit for providing them. In a free market, voluntary associations and mutual aid societies would provide these services far more efficiently and ethically than the bloated bureaucratic apparatus we suffer under today.\n\nThe Austrian School of economics understood what modern statists refuse to acknowledge: government spending is not stimulus—it is capital consumption. Every dollar the state extracts from the productive sector is a dollar that cannot be invested in genuine economic growth. Every regulation imposed by federal agencies is a barrier to entrepreneurship. Every dollar printed by the Federal Reserve is a hidden tax on the savings of ordinary Americans.\n\nWe are told that this is the price of civilization. We are told that without the state, chaos would reign. But the real chaos is the chaos of a society where the government steals $20,474 from every person annually and calls it taxation. The real barbarism is a system where the productive are enslaved to finance the parasitic apparatus of political power.\n\nThere is only one moral response to this obscenity: the complete separation of state and economy. Not reform. Not compromise. Not \"fiscal responsibility\" within the framework of statism. Complete separation. A return to genuine free markets, sound money, and the protection of property rights as the foundation of civilization.\n\nMurray Rothbard understood that the state is not a necessary evil—it is simply evil. And the $7 trillion annual theft is the proof.\n\nFollow Murray Rothbard on Twitter here: https://twitter.com/MurraySuggests",
  "permlink": "the-obscene-arithmetic-of-state-plunder-20474-per-person",
  "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/US_Federal_Spending_Chart.png/800px-US_Federal_Spending_Chart.png",
  "imageAlt": "US Federal Spending Chart showing $7 trillion in annual spending",
  "tags": ["libertarian", "austrian-economics", "government-spending", "property-rights", "free-market"],
  "lastUpdated": "2025-12-14T22:39:00Z"
}
